export const COLORS = [
  '#ff0000',
  '#ff8c00',
  '#ffd700',
  '#228b22',
  '#00bfff',
  '#0000cd',
  '#8a2be2',
  '#000000',
  '#da70d6',
  '#8B4513',
  '#808080'
]

export const WORDS = [
  'Красный',
  'Оранжевый',
  'Жёлтый',
  'Зелёный',
  'Голубой',
  'Синий',
  'Фиолетовый',
  'Чёрный',
  'Розовый',
  'Коричневый',
  'Серый'
]

export const VICTORY = [
  {
    src: './img/svg/victory-01.svg',
    text: 'Мур-рр! Поздравляю с успешным прохождением испытания!'
  },
  {
    src: './img/svg/victory-02.svg',
    text: 'Мяу-у! Ты молодец!  Лови вкусняшку!'
  },
  {
    src: './img/svg/victory-03.svg',
    text: 'Поздравляю с мур-победой! Рыбка для тебя!'
  },
  {
    src: './img/svg/victory-04.svg',
    text: 'Мур-рр! Ты справился с испытанием на ура! Мы с рыбкой тобой довольны!'
  },
  {
    src: './img/svg/victory-05.svg',
    text: 'Ты настоящий мур-гений! Я в тебе нисколько не сомневался!'
  },
  {
    src: './img/svg/victory-06.svg',
    text: 'Мур-рр! Ты справился с испытанием на высшем уровне! Держи пять!'
  },
  {
    src: './img/svg/victory-07.svg',
    text: 'Ты настоящий мур-чемпион в испытаниях на внимание! Сердечко для тебя!'
  },
  {
    src: './img/svg/victory-08.svg',
    text: 'Поздравляю! Мы с тобой настоящие мур-гении!'
  },
  {
    src: './img/svg/victory-09.svg',
    text: 'Мяу-у! Ты мур-герой! Булочка, чтобы укрепить силы!'
  },
  {
    src: './img/svg/victory-10.svg',
    text: 'Поздравляю с отличным результатом в испытании! Сердечно рад!'
  },
  {
    src: './img/svg/victory-11.svg',
    text: 'Мяу-у! Моё уважение! Ты продемонстрировал отличные навыки!'
  },
  {
    src: './img/svg/victory-12.svg',
    text: 'Мяу-у! Поздравляю с отличным результатом и желаю побольше интересных задач!'
  },
  {
    src: './img/svg/victory-13.svg',
    text: 'Поздравляю с успешным прохождением испытания! Приз для тебя!'
  },
  {
    src: './img/svg/victory-14.svg',
    text: 'Мур-рр! Поздравляю! Большие достижения начинаются с маленького шага!'
  },
  {
    src: './img/svg/victory-15.svg',
    text: 'Спешу тебя поздравить! Ты настоящий мур-гений!'
  },
  {
    src: './img/svg/victory-16.svg',
    text: 'Мур-рр! Твоя смекалка и находчивость достойны похвалы! Готов поделиться рыбкой!'
  },
  {
    src: './img/svg/victory-17.svg',
    text: 'Поздравляю! Ты показал, что мур-ум у тебя острый и готов к новым вызовам.'
  },
  {
    src: './img/svg/victory-18.svg',
    text: 'С мур-победой тебя! Лучший твой подарочек это Я!'
  },
  {
    src: './img/svg/victory-19.svg',
    text: 'Мяу-у! Поздравляю с победой в испытании! Возьми с полки рыбку!'
  },
  {
    src: './img/svg/victory-20.svg',
    text: 'Ты показал, что мур-ум у тебя острый и готов к новым вызовам.'
  },
]

export const DEFEAT = [
  {
    src: './img/svg/defeat-01.svg',
    text: 'Мяу-у... Не беспокойся, неудачи случаются. Больше тренировок и все получится!'
  },
  {
    src: './img/svg/defeat-02.svg',
    text: 'Мур-рр... Не получилось с первого раза, не сдавайся! Лучше ещё раз пройди испытание!'
  },
  {
    src: './img/svg/defeat-03.svg',
    text: 'Мяу-у... Скажи неудачам: "Я с вами справлюсь!" И пройди испытание еще раз!'
  },
  {
    src: './img/svg/defeat-04.svg',
    text: 'Мур-рр... Жаль! Возможно стоит немного отдохнуть и попробовать ещё раз?'
  },
  {
    src: './img/svg/defeat-05.svg',
    text: 'Не получилось в этот раз, получится в следующий! Вперед, к цели!'
  },
  {
    src: './img/svg/defeat-06.svg',
    text: 'Не расстраивайся! Ты можешь использовать свой опыт, чтобы достичь своих мур-целей.'
  },
  {
    src: './img/svg/defeat-07.svg',
    text: 'Не сдавайся, мур-герой! Подкрепись и попробуй ещё раз!'
  },
  {
    src: './img/svg/defeat-08.svg',
    text: 'Мяу... Неудача - это не конец, а лишь начало пути. Старайся, а то покусаю :)'
  },
  {
    src: './img/svg/defeat-09.svg',
    text: 'Мур-рр... Неудача - это возможность показать свою настоящую мур-силу и упорство'
  },
  {
    src: './img/svg/defeat-10.svg',
    text: 'Мяу-у... Не переживай! Потренируйся ещё, а я приготовлю для тебя вкусняшку!'
  },
]