export const COLORS = [
  '#ff0000',
  '#ff8c00',
  '#ffd700',
  '#228b22',
  '#00bfff',
  '#0000cd',
  '#8a2be2',
  '#000000',
  '#da70d6',
  '#8B4513',
  '#808080'
]

export const WORDS = [
  'Красный',
  'Оранжевый',
  'Жёлтый',
  'Зелёный',
  'Голубой',
  'Синий',
  'Фиолетовый',
  'Чёрный',
  'Розовый',
  'Коричневый',
  'Серый'
]

export const VICTORY = [
  {
    src: './img/svg/victory-01.svg',
    text: 'Молодец!<br> Так держать!'
  },
  {
    src: './img/svg/victory-02.svg',
    text: 'Умничка!<br> Лови вкусняшку!'
  },
  {
    src: './img/svg/victory-03.svg',
    text: 'Хвалю!<br> Рыбка для тебя!'
  },
  {
    src: './img/svg/victory-04.svg',
    text: 'Поздравляю!<br> Мы с рыбкой тобой довольны!'
  },
  {
    src: './img/svg/victory-05.svg',
    text: 'Здорово!<br> Я в тебе нисколько не сомневался!'
  },
]

export const DEFEAT = [
  {
    src: './img/svg/defeat-01.svg',
    text: 'Не расстраивайся!<br> Больше тренировок и все получится!'
  },
  {
    src: './img/svg/defeat-02.svg',
    text: 'Не переживай!<br> Лучше ещё раз пройди испытание!'
  },
  {
    src: './img/svg/defeat-03.svg',
    text: 'Скажи неудачам: "Я с вами справлюсь!" И пройди испытание еще раз'
  },
  {
    src: './img/svg/defeat-04.svg',
    text: 'Жаль! Возможно стоит немного отдохнуть и попробовать ещё раз!'
  },
  {
    src: './img/svg/defeat-05.svg',
    text: 'Не получилось в этот раз, получится в следующий! Вперед, к цели!'
  },
]